### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.postgres.azurerm_key_vault_secret.pgres_flex_admin_pwd has moved to module.key_vault.azurerm_key_vault_secret.pgres_flex_admin_pwd
    resource "azurerm_key_vault_secret" "pgres_flex_admin_pwd" {
        id                      = "https://io-p-itn-svc-kv.vault.azure.net/secrets/pgres-flex-admin-pwd/ade012f6e95b43b0be0ec3fcf5be555d"
        name                    = "pgres-flex-admin-pwd"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # module.postgres.azurerm_key_vault_secret.pgres_flex_readonly_usr_pwd has moved to module.key_vault.azurerm_key_vault_secret.pgres_flex_readonly_usr_pwd
    resource "azurerm_key_vault_secret" "pgres_flex_readonly_usr_pwd" {
        id                      = "https://io-p-itn-svc-kv.vault.azure.net/secrets/pgres-flex-readonly-usr-pwd/623edb551e844230a5b5b6a96a5c3587"
        name                    = "pgres-flex-readonly-usr-pwd"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # module.postgres.azurerm_key_vault_secret.pgres_flex_reviewer_usr_pwd has moved to module.key_vault.azurerm_key_vault_secret.pgres_flex_reviewer_usr_pwd
    resource "azurerm_key_vault_secret" "pgres_flex_reviewer_usr_pwd" {
        id                      = "https://io-p-itn-svc-kv.vault.azure.net/secrets/pgres-flex-reviewer-usr-pwd/ced395865d9e485188dff4340b64256d"
        name                    = "pgres-flex-reviewer-usr-pwd"
        tags                    = {}
        # (9 unchanged attributes hidden)
    }

  # module.postgres.random_password.postgres_admin_password["1682602957131"] has moved to module.key_vault.random_password.postgres_admin_password["1682602957131"]
    resource "random_password" "postgres_admin_password" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

  # module.postgres.random_password.postgres_readonly_usr_password["1682602957131"] has moved to module.key_vault.random_password.postgres_readonly_usr_password["1682602957131"]
    resource "random_password" "postgres_readonly_usr_password" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

  # module.postgres.random_password.postgres_reviewer_usr_password["1682602957131"] has moved to module.key_vault.random_password.postgres_reviewer_usr_password["1682602957131"]
    resource "random_password" "postgres_reviewer_usr_password" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "ACTIVATIONS_CONTAINER_NAME"                                                                       = "activations-test" -> "activations"
          ~ "LEGACY_COSMOSDB_CONTAINER_ACTIVATIONS_LEASE"                                                      = "activations-sync-lease-TEST" -> "activations-sync-lease"
          - "SYNC_ACTIVATIONS_POISON_QUEUE"                                                                    = "sync-activations-from-legacy-poison" -> null
            # (131 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01"
        name                                           = "io-p-itn-svc-cms-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "2.0.0"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsWebHost__hostid",
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              - "AzureWebJobs.ActivationsSyncFromLegacy.Disabled",
              - "AzureWebJobs.IngestionActivationWatcher.Disabled",
              - "AzureWebJobs.IngestionServiceHistoryWatcher.Disabled",
              - "AzureWebJobs.IngestionServiceLifecycleWatcher.Disabled",
              - "AzureWebJobs.IngestionServicePublicationWatcher.Disabled",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.LegacyServiceWatcher.Disabled",
              - "AzureWebJobs.OnRequestDeletion.Disabled",
              - "AzureWebJobs.OnRequestDetail.Disabled",
              + "AzureWebJobs.ServiceLifecycleWatcher.Disabled",
              + "AzureWebJobs.ServicePublicationWatcher.Disabled",
              + "AzureWebJobs.ServiceReviewChecker.Disabled",
              + "AzureWebJobs.ServiceHistoryWatcher.Disabled",
                "AzureWebJobs.OnRequestHistoricization.Disabled",
                # (1 unchanged element hidden)
                "AzureWebJobs.OnRequestReview.Disabled",
              - "AzureWebJobs.OnRequestReviewLegacy.Disabled",
              - "AzureWebJobs.OnRequestServicesHistoryIngestionRetry.Disabled",
              - "AzureWebJobs.OnRequestServicesLifecycleIngestionRetry.Disabled",
              - "AzureWebJobs.OnRequestServicesPublicationIngestionRetry.Disabled",
                "AzureWebJobs.OnRequestSyncCms.Disabled",
                "AzureWebJobs.OnRequestSyncLegacy.Disabled",
              + "AzureWebJobs.OnRequestReviewLegacy.Disabled",
              + "AzureWebJobs.ServiceReviewLegacyChecker.Disabled",
                "AzureWebJobs.OnRequestValidation.Disabled",
              - "AzureWebJobs.SelfcareGroupWatcher.Disabled",
              + "AzureWebJobs.OnRequestDeletion.Disabled",
              + "AzureWebJobs.OnRequestDetail.Disabled",
                "AzureWebJobs.ServiceDetailLifecycleWatcher.Disabled",
                "AzureWebJobs.ServiceDetailPublicationWatcher.Disabled",
              - "AzureWebJobs.ServiceHistoryWatcher.Disabled",
              - "AzureWebJobs.ServiceLifecycleWatcher.Disabled",
              - "AzureWebJobs.ServicePublicationWatcher.Disabled",
              - "AzureWebJobs.ServiceReviewChecker.Disabled",
              - "AzureWebJobs.ServiceReviewLegacyChecker.Disabled",
              + "AzureWebJobs.IngestionServicePublicationWatcher.Disabled",
              + "AzureWebJobs.OnRequestServicesPublicationIngestionRetry.Disabled",
              + "AzureWebJobs.IngestionServiceLifecycleWatcher.Disabled",
              + "AzureWebJobs.OnRequestServicesLifecycleIngestionRetry.Disabled",
              + "AzureWebJobs.IngestionServiceHistoryWatcher.Disabled",
              + "AzureWebJobs.OnRequestServicesHistoryIngestionRetry.Disabled",
                "AzureWebJobs.ServiceTopicsIngestor.Disabled",
              - "SLOT_TASK_HUBNAME",
              - "AzureFunctionsJobHost__extensions__durableTask__hubName",
              - "AzureFunctionsWebHost__hostid",
              + "AzureWebJobs.SelfcareGroupWatcher.Disabled",
              + "AzureWebJobs.IngestionActivationWatcher.Disabled",
              + "AzureWebJobs.ActivationsSyncFromLegacy.Disabled",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eventhub.module.eventhub.azurerm_eventhub.events["io-p-itn-svc-elt-activations-01"] will be updated in-place
  ~ resource "azurerm_eventhub" "events" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-svc-elt-evhns-01/eventhubs/io-p-itn-svc-elt-activations-01"
      ~ message_retention   = 1 -> 7
        name                = "io-p-itn-svc-elt-activations-01"
        # (6 unchanged attributes hidden)
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_management_lock.this[0] will be created
  + resource "azurerm_management_lock" "this" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-itn-svc-cms-psql-01"
      + notes      = "Locked via Terraform"
      + scope      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01"
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["active_connections"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-ACTIVE_CONNECTIONS"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01",
        ]
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "active_connections"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["connections_failed"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-CONNECTIONS_FAILED"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01",
        ]
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "connections_failed"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["cpu_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-CPU_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01",
        ]
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["memory_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-MEMORY_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01",
        ]
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["storage_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-STORAGE_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01",
        ]
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_postgresql_flexible_server.this will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "this" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ administrator_login               = (sensitive value)
      + administrator_password            = (sensitive value)
      ~ auto_grow_enabled                 = false -> true
      + create_mode                       = "Default"
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01"
        name                              = "io-p-itn-svc-cms-psql-01"
      ~ tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "ModuleName"     = "azure_postgres_server"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.6"
            "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-services-cms" -> "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (15 unchanged attributes hidden)

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 3
          + start_hour   = 2
          + start_minute = 0
        }

        # (1 unchanged block hidden)
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_postgresql_flexible_server_configuration.pgbouncer[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgbouncer" {
      + id        = (known after apply)
      + name      = "pgbouncer.enabled"
      + server_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01"
      + value     = "true"
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_private_endpoint.postgre_pep will be created
  + resource "azurerm_private_endpoint" "postgre_pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-cms-psql-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "ModuleName"     = "azure_postgres_server"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.6"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-cms-psql-pep-01"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.postgres.module.pgres_snet.azurerm_subnet.this will be updated in-place
  # (moved from module.postgres_snet.module.pgres_snet.azurerm_subnet.this)
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-pgres-snet-01"
        name                                          = "io-p-itn-svc-pgres-snet-01"
      ~ service_endpoints                             = [
          - "Microsoft.Storage",
        ]
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 4 to change, 0 to destroy.
```

</details>
